---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures
source: html/6a9d497c-6923-0689-e0bd-2cd00fb792f8.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures

Failures about Connector.

## Syntax (C#)
```csharp
public static class ConnectorFailures
```